Revit 2027 API
ParameterTypeId.SpatialFieldMgrCurrentName Property
 "Analysis Configuration"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SpatialFieldMgrCurrentName { get; }
Public Shared ReadOnly Property SpatialFieldMgrCurrentName As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SpatialFieldMgrCurrentName {
	ForgeTypeId^ get ();
}
static member SpatialFieldMgrCurrentName : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace